Repository: denisrennes/shrink_pdf
Catalog: locale/*/LC_MESSAGES/install.po
Languages: fr

source: Press any key...
fr: Appuyez sur une touche...

source: [y/n]:
fr: [o/n]

source: Y
fr: O

source: Shrink PDF
fr: Réduire PDF

source: ERROR: The "gs" command is required but not installed. (Ghostscript)
fr: ERREUR: La commande "gs" est requise mais n'est pas installée. (Ghostscript)

source: This will install a shell command "${script_filename}".
fr: Cela va installer la commande shell "${script_filename}".

source: This will also install a new "${nemo_action_menu}" context menu entry ("right-click") in Nemo, the file manager, for PDF files.
fr: Cela va installer un nouveau choix "${nemo_action_menu}" dans le menu contextuel ("clic-droit") de Nemo le gestionnaire de fichiers, pour les fichiers PDF.

source: As the file manager Nemo has NOT been detected, this will NOT install a new "${nemo_action_menu}" context menu entry ("right-click") in Nemo, for PDF files.
fr: Comme le gestionnaire de fichiers Nemo n'a pas été détecté, il n'y aura PAS d'installation du nouveau choix "${nemo_action_menu}" dans le menu contextuel ("clic-droit") de Nemo, pour les fichiers PDF.

source: Continue?
fr: Continuer ?

source: Canceled, ok.
fr: Annulé, ok.'

source: We need elevated privileges to install:
fr: Nous avons besoins de privilèges élevés pour installer :

source: Installation canceled: Failed to get elevated privileges (sudo).
fr: Installation annulée : échec pour l'obtention des privilèges élevés (sudo).

source: ok for elevated privileges (sudo).
fr: ok pour les privilèges élevés (sudo).

source: Installation of "${file_name}" to "${dest_directory}" ...
fr: Installation de "${file_name}" vers "${dest_directory}" ...

source: The installation succeeded.
fr: L'installation a réussi.

source: You may have to close and relaunch the file manager Nemo to use the new "${nemo_action_menu}" context menu entry for PDF files.
fr: Vous aurez peut-être à fermer et relancer le gestionnaire de fichiers Nemo pour utiliser le nouveau choix "${nemo_action_menu}" du menu contextuel des fichiers PDF.
