Repository: denisrennes/shrink_pdf
Catalog: locale/*/LC_MESSAGES/shrink_pdf.po
Languages: fr

source: Press any key...
fr: Appuyez sur une touche...

source: .TEMP_SHRINKED
fr: .TEMP_REDUIT

source: The file "${input_file}" is skipped because it is probably the shrinked result of "${bak_file_filename}"
fr: Le fichier "${input_file}" est ignoré parce que c'est probablement le résultat de la réduction de "${bak_file_filename}"

source: Le fichier "${input_file}" is skipped because it has been already shrinked before. To shrink it again, rename it to its original name.
fr: The file "${input_file}" est ignoré parce qu'il a déjà été réduit avant. Pour le réduire une autre fois, renommez-le avec son nom d'origine.

source: Shrink the PDF file "${input_file}", ${filesize_input_file_kB} kB ...
fr: Réduction du fichier PDF "${input_file}", ${filesize_input_file_kB} kB ...

source: ERROR: unable to delete "${result_file}" before starting shrinking.
fr: ERREUR: impossible d'effacer "${result_file}" avant de démmarer lé réduction.

source: ERROR: The shrinking command returned an error (exit code ${exit_code} returned by 'gs', a command from Ghostscript).
fr: ERREUR: La commande de réduction a retourné une erreur (exit code ${exit_code} retourné par 'gs', une commande de Ghostscript).

source: ERROR: something went wrong, no shrinking result file.
fr: ERROR: quelque chose s'est mal passé, pas de fichier résultat de la réduction.

source: ERROR: something went wrong after shrinking. Unable to rename the original file as "${bak_file}".
fr: ERREUR: quelque chose s'est mal passé après la réduction. Impossible de renommer le fichier original en "${bak_file}".

source: ERROR: something went wrong after shrinking. Unable to move the renamed original file to the Trash.
fr: ERREUR: quelque chose s'est mal passé après la réduction. Impossible de déplacer vers la corbeille le fichier original renommé.

source: ERROR: something went wrong after shrinking. Unable to renamed the temporary result file name "${result_file}" as the original file name.
fr: ERREUR: quelque chose s'est mal passé après la réduction. Impossible de renommer le fichier résultat, de son nom temporaire "${result_file}" vers le nom du fichier original.

source: ok: now ${filesize_result_file_kB} kB.
fr: ok: maintenant ${filesize_result_file_kB} kB.

source: The original unshrinked file is now in the Trash, renamed "${bak_file_filename}" .
fr: Le fichier original non-réduit est maintenant dans la Corbeille, renommé "${bak_file_filename}" .

source: This PDF file is already small.
fr: Ce fichier PDF est déjà petit.

source: Press any key to exit...
fr: Appuyez sur une touche...
